# 1.11. f ֆունկցիան սահմանվում է հետևայլ կերպ.
# f(n) = n, եթե n < 3
# f(n) = f(n - 1) + f(n - 2) + f(n - 3), եթե n >= 3
#n-ը կարող է լինել միայն 0 և դրական ամբողջ թիվ։
# Իրականացրեք լուծումը ռեկուրսիվ, իտերատիվ և պոչավոր ռեկուրսիվ տարբերակներով։
# ռեկուրսիվ
def f(n):
    if n < 3:
        return n
    return f(n-1) + f(n-2) + f(n-3)

# տարբերակ, պոչավո՞ր
def f(n):
    seq = [0,1,2]
    for i in range(3,n+1):
        seq.append(seq[i-1]+seq[i-2]+seq[i-3])
    return seq[n]

# իտերատիվ
def f(n):
    a,b,c = 0,1,2
    while n > 0:
        a,b,c, = b,c,a+b+c
        n -= 1
    return a
